{
    "basic_info": {
      "description_header": "Hi",
      "description": ["I'm a software engineer with a passion for crafting applications that seamlessly merge technical prowess with captivating design. My journey began as a Software Engineer at STMicroelectronics, where I honed my skills in Java, Spring Boot, React and Relational Databases. This experience laid the foundation for my Master's at Virginia Tech as well as internship at MathWorks.",
                      "Currently, I'm an Application Engineer at Myers Lawson School of Construction, Virginia Tech. Here, I'm focused on developing a web application that bridges the gap between instructors and industry practitioners, leveraging my knack for combining technical depth with a keen eye for design.",
                      "Beyond the world of software, you can find me exploring hiking trails, cheering on my favorite sports teams, or ticking off items from my bucket list."],
      "section_name": {
        "about": "About me",
        "projects": "Projects",
        "skills": "Skills",
        "experience": "Experience"
      }
    },
    "projects": [
      {
        "title": "GeoViz",
        "startDate": "2022",
        "description": "A web portal to help Internet Service Providers submit their coverage data by providing visualization of submitted data along with automated file validation, query resolution, and file management.",
        "images": [
          "images/portfolio/geoviz/p1.png"
        ],
        "url": "https://geoviz.dev.cgit.vt.edu/",
        "technologies": [
          {
            "class": "devicon-django-plain-wordmark",
            "name": "Django"
          },
          {
            "class": "devicon-python-plain",
            "name": "Python"
          },
          {
            "class": "devicon-postgresql-plain",
            "name": "Postgres SQL"
          }
        ]
      },
      {
        "title": "Market Divers",
        "startDate": "2022",
        "description": "Developed visualizations in D3.js to get better insights into Data Science related jobs in the United States. Utilized visualization principles such as CRAP to build an effective data story",
        "images": [
          "images/portfolio/market-divers/p1.png"
        ],
        "url": "https://github.com/nandaanubhav/nandaanubhav.github.io",
        "technologies": [
          {
            "class": "devicon-d3js-original",
            "name": "D3.js"
          },
          {
            "class": "devicon-javascript-plain",
            "name": "JavaScript"
          }
        ]
      },
      {
        "title": "Calmify",
        "startDate": "2021",
        "description": "A web application to overcome the problem of mental health. It provides uplifting quotes, motivational videos from YouTube, a custom shop for mental health products integrating with PayPal for payment, and a subscription service to receive daily motivational quotes",
        "images": [
          "images/portfolio/calmify/p1.png"
        ],
        "url": "https://github.com/nandaanubhav/Calmify",
        "technologies": [
          {
            "class": "devicon-java-plain",
            "name": "Java"
          },
          {
            "class": "devicon-mysql-plain",
            "name": "MySQL"
          },
          {
            "class": "devicon-amazonwebservices-plain-wordmark",
            "name": "AWS"
          }
        ]
      }
    ],
    "experience": [
      {
        "company": "Myers Lawson School of Construction, Virgnia Tech",
        "title": "Software Engineer",
        "years": "Aug 2022 - Present",
        "mainTech": [
          "Node.js"
        ],
        "mainTechIcon": "devicon-nodejs-plain experience-icon",
        "technologies": [
          "REST API",
          "JavaScript",
          "Vue.js",
          "Bootstrap",
          "D3.js"
        ],
        
        "projects": ["Developed a web application to facilitate risk assessment for construction tasks, increasing user engagement by 8.89%, and decreasing cognitive load by 46.11%",
        "Designed and implemented a web platform utilizing Vue, TypeScript, NodeJS, Express, and MySQL which helped connect instructors with industry practitioners to seek support for Course Support Requests",
        "Achieved 99.99% uptime leveraging Apache Kafka to implement real-time notification service",
        "Implemented lazy loading to reduce initial bundle size, leading to 70% faster load times"]
      },
      {
        "company": "Mathworks",
        "title": "Softwar Development Intern",
        "years": "May 2022 - Aug 2022",
        "mainTech": [
          "C++"
        ],
        "mainTechIcon": "devicon-cplusplus-plain experience-icon",
        "technologies": [
          "Boost C++",
          "Google Test"
        ],
        "projects": ["• Engineered a C++ program to convert Bullseye Code Coverage Data into a standardized format, enabling efficient real-time code coverage matrix computations",
        "Automated build, test, and deployment process using CI/CD pipeline to increase code reliability by 30%"]
      },
      {
        "company": "STMicroelectronics",
        "title": "Senior Software Engineer",
        "years": "Jul 2019 - Aug 2021",
        "mainTech": [
          "Java"
        ],
        "mainTechIcon": "devicon-java-plain experience-icon",
        "technologies": [
          "Spring",
          "Spring Boot",
          "REST API",
          "JavaScript",
          "React.js",
          "C++"
        ],
        "projects": ["Developed an Automatic Price Revision module using REST APIs with Java Spring Boot, React, and Redux processing orders amounting to $2 billion annually",
        "Designed and implemented Microservice architecture to facilitate seamless communication between an ERP system and an e-commerce solution deployed on Microsoft Azure, decreasing P99 latency by 23%",
        "Led the project to change pricing precision from 3 decimals to 4 decimals increasing revenue by 6% per year",
        "Recipient of Company Strategic Award (Star Gold Award) for excellent contribution towards annual goals"
        ]
      },
      {
        "company": "STMicroelectronics",
        "title": "Software Engineer",
        "years": "Oct 2016 - Jul 2019",
        "mainTech": [
          "Java"
        ],
        "mainTechIcon": "devicon-java-plain experience-icon",
        "technologies": [
          "Spring",
          "Spring Boot",
          "REST API",
          "JavaScript",
          "React.js",
          "C++"
        ],
        "projects": ["Saved 192 Days annually by enhancing user productivity using an automated workflow solution for rule-based approval of Order Change and Free of Cost Samples with Java Spring, JavaScript, and Oracle database",
        "Engineered “Paid Sample Approval” application facilitating simplification of business processing 27k sample orders worth $10 million, saving 60 person-days annually",
        "Optimized legacy code implementations in C++ increasing performance by more than 15%"]
      }
    ]
  }