{
    "basic_info": {
      "description_header": "Hi",
      "description": ["I'm a software engineer with a passion for crafting applications that seamlessly merge technical prowess with captivating design. My journey began as a Software Engineer at STMicroelectronics, where I honed my skills in Java, Spring Boot, React and Relational Databases. This experience laid the foundation for my Master's at Virginia Tech as well as internship at MathWorks.",
                      "Currently, I'm an Application Engineer at Myers Lawson School of Construction, Virginia Tech. Here, I'm focused on developing a web application that bridges the gap between instructors and industry practitioners, leveraging my knack for combining technical depth with a keen eye for design.",
                      "Beyond the world of software, you can find me exploring hiking trails, cheering on my favorite sports teams, or ticking off items from my bucket list."],
      "section_name": {
        "about": "About me",
        "projects": "Projects",
        "skills": "Skills",
        "experience": "Experience"
      }
    },
    "projects": [
      {
        "title": "GeoViz",
        "startDate": "2022",
        "description": "A web portal to help Internet Service Providers submit their coverage data by providing visualization of submitted data along with automated file validation, query resolution, and file management.",
        "images": [
          "images/portfolio/geoviz/p1.png"
        ],
        "url": "https://geoviz.dev.cgit.vt.edu/",
        "technologies": [
          {
            "class": "devicon-django-plain-wordmark",
            "name": "Django"
          },
          {
            "class": "devicon-python-plain",
            "name": "Python"
          },
          {
            "class": "devicon-postgresql-plain",
            "name": "Postgres SQL"
          }
        ]
      },
      {
        "title": "Market Divers",
        "startDate": "2022",
        "description": "Developed visualizations in D3.js to get better insights into Data Science related jobs in the United States. Utilized visualization principles such as CRAP to build an effective data story",
        "images": [
          "images/portfolio/market-divers/p1.png"
        ],
        "url": "https://github.com/nandaanubhav/nandaanubhav.github.io",
        "technologies": [
          {
            "class": "devicon-d3js-original",
            "name": "D3.js"
          },
          {
            "class": "devicon-javascript-plain",
            "name": "JavaScript"
          }
        ]
      },
      {
        "title": "Calmify",
        "startDate": "2021",
        "description": "A web application to overcome the problem of mental health. It provides uplifting quotes, motivational videos from YouTube, a custom shop for mental health products integrating with PayPal for payment, and a subscription service to receive daily motivational quotes",
        "images": [
          "images/portfolio/calmify/p1.png"
        ],
        "url": "https://github.com/nandaanubhav/Calmify",
        "technologies": [
          {
            "class": "devicon-java-plain",
            "name": "Java"
          },
          {
            "class": "devicon-mysql-plain",
            "name": "MySQL"
          },
          {
            "class": "devicon-amazonwebservices-plain-wordmark",
            "name": "AWS"
          }
        ]
      }
    ],
    "experience": [
      {
        "company": "Myers Lawson School of Construction, Virgnia Tech",
        "title": "Application Engineer",
        "years": "Aug 2022 - Present",
        "mainTech": [
          "Node.js"
        ],
        "mainTechIcon": "devicon-nodejs-plain experience-icon",
        "technologies": [
          "REST API",
          "JavaScript",
          "Vue.js",
          "Bootstrap",
          "D3.js"
        ],
        "projects": ["Deployed a low code/no code tool to facilitate risk assessment for construction tasks which in turn motivated students to incorporate programming into their skills",
                    "Designed and implemented a web platform which helped in connecting instructors with industry practitioners to seek support for Course Support Requests"]
      },
      {
        "company": "Mathworks",
        "title": "EDG Intern",
        "years": "May 2022 - Aug 2022",
        "mainTech": [
          "C++"
        ],
        "mainTechIcon": "devicon-cplusplus-plain experience-icon",
        "technologies": [
          "Boost C++",
          "Google Test"
        ],
        "projects": ["Developed a C++ program to transform Bullseye code coverage data to MathWorks standard format which facilitated real-time code coverage matrix calculation"]
      },
      {
        "company": "STMicroelectronics",
        "title": "Senior Software Engineer",
        "years": "Jul 2019 - Aug 2021",
        "mainTech": [
          "Java"
        ],
        "mainTechIcon": "devicon-java-plain experience-icon",
        "technologies": [
          "Spring",
          "Spring Boot",
          "REST API",
          "JavaScript",
          "React.js",
          "C++"
        ],
        "projects": ["Led the design and development of Automatic Price Revision module, which processed orders amounting to $2 billion per year",
        "Designed and Implemented Microservice architecture to help seamless communication between ERP system and “e-Commerce” solution deployed on Microsoft Azure", 
        "Developed a “Paid Sample Approval” application facilitating simplification of business processes through workflow enabling the system to process 27k sample orders worth $10 million annually",
        "Led the project to change pricing precision from 3 decimals to 4 decimals increasing revenue by 6% per year"]
      },
      {
        "company": "STMicroelectronics",
        "title": "Software Engineer",
        "years": "Oct 2016 - Jul 2019",
        "mainTech": [
          "Java"
        ],
        "mainTechIcon": "devicon-java-plain experience-icon",
        "technologies": [
          "Spring",
          "Spring Boot",
          "REST API",
          "JavaScript",
          "React.js",
          "C++"
        ],
        "projects": ["Engineered an automated workflow solution for rule-based approval of Order Change and Free of Cost Samples enabling user productivity saving 192 man-days per year",
        "Initiated and introduced several automation and productivity features in the sales process application like Multiple Order Variation, Final/End Customer price application on direct orders saving 60 man-days annually"]
      }
    ]
  }